evidencias-pruebas/artillery-output-atlas-pool.txt
Test run id: tkj7q_e8mngetffzxzgp8ena4h3a9fezd4q_mfbf
Phase started: 1. 🧪 Fase de Calentamiento (Tráfico Base) (index: 0, duration: 20s) 22:21:05(-0500)

Phase completed: 1. 🧪 Fase de Calentamiento (Tráfico Base) (index: 0, duration: 20s) 22:21:25(-0500)

Phase started: 2. 🧪 Fase de Saturación Máxima (Pico de Carga) (index: 1, duration: 30s) 22:21:25(-0500)

--------------------------------------
Metrics for period to: 22:21:10(-0500) (width: 3.368s)
--------------------------------------

http.codes.201: ................................................................ 20
http.codes.400: ................................................................ 15
http.downloaded_bytes: ......................................................... 8420
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 35
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 168
  mean: ........................................................................ 91
  median: ...................................................................... 156
  p95: ......................................................................... 162.4
  p99: ......................................................................... 162.4
http.response_time.2xx:
  min: ......................................................................... 155
  max: ......................................................................... 168
  mean: ........................................................................ 158.8
  median: ...................................................................... 159.2
  p95: ......................................................................... 162.4
  p99: ......................................................................... 162.4
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 1
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.responses: ................................................................ 35
vusers.completed: .............................................................. 15
vusers.created: ................................................................ 20
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1160.3
  max: ......................................................................... 1182.5
  mean: ........................................................................ 1166.4
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1176.4


--------------------------------------
Metrics for period to: 22:21:20(-0500) (width: 9.365s)
--------------------------------------

http.codes.201: ................................................................ 50
http.codes.400: ................................................................ 50
http.downloaded_bytes: ......................................................... 24300
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 169
  mean: ........................................................................ 79
  median: ...................................................................... 1
  p95: ......................................................................... 159.2
  p99: ......................................................................... 162.4
http.response_time.2xx:
  min: ......................................................................... 154
  max: ......................................................................... 169
  mean: ........................................................................ 157.5
  median: ...................................................................... 156
  p95: ......................................................................... 162.4
  p99: ......................................................................... 162.4
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 1
  mean: ........................................................................ 0.4
  median: ...................................................................... 0
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.responses: ................................................................ 100
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1157.5
  max: ......................................................................... 1173.7
  mean: ........................................................................ 1161.6
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1176.4


--------------------------------------
Metrics for period to: 22:21:30(-0500) (width: 9.723s)
--------------------------------------

http.codes.201: ................................................................ 99
http.codes.400: ................................................................ 85
http.downloaded_bytes: ......................................................... 44474
http.request_rate: ............................................................. 29/sec
http.requests: ................................................................. 189
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 179
  mean: ........................................................................ 86
  median: ...................................................................... 156
  p95: ......................................................................... 162.4
  p99: ......................................................................... 172.5
http.response_time.2xx:
  min: ......................................................................... 154
  max: ......................................................................... 179
  mean: ........................................................................ 159.2
  median: ...................................................................... 159.2
  p95: ......................................................................... 165.7
  p99: ......................................................................... 172.5
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 0.8
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.responses: ................................................................ 184
vusers.completed: .............................................................. 85
vusers.created: ................................................................ 104
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  104
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1157.4
  max: ......................................................................... 1183.3
  mean: ........................................................................ 1165.9
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1176.4


--------------------------------------
Metrics for period to: 22:21:40(-0500) (width: 9.951s)
--------------------------------------

http.codes.201: ................................................................ 256
http.codes.400: ................................................................ 244
http.downloaded_bytes: ......................................................... 121296
http.request_rate: ............................................................. 52/sec
http.requests: ................................................................. 502
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 516
  mean: ........................................................................ 82.6
  median: ...................................................................... 156
  p95: ......................................................................... 162.4
  p99: ......................................................................... 165.7
http.response_time.2xx:
  min: ......................................................................... 154
  max: ......................................................................... 516
  mean: ........................................................................ 160.5
  median: ...................................................................... 159.2
  p95: ......................................................................... 165.7
  p99: ......................................................................... 169
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 9
  mean: ........................................................................ 0.9
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 4
http.responses: ................................................................ 500
vusers.completed: .............................................................. 244
vusers.created: ................................................................ 258
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  258
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1157.2
  max: ......................................................................... 1530.5
  mean: ........................................................................ 1167.3
  median: ...................................................................... 1176.4
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1176.4


Phase completed: 2. 🧪 Fase de Saturación Máxima (Pico de Carga) (index: 1, duration: 30s) 22:21:55(-0500)

--------------------------------------
Metrics for period to: 22:21:50(-0500) (width: 9.985s)
--------------------------------------

http.codes.201: ................................................................ 378
http.codes.400: ................................................................ 366
http.downloaded_bytes: ......................................................... 180588
http.request_rate: ............................................................. 75/sec
http.requests: ................................................................. 746
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 534
  mean: ........................................................................ 82.2
  median: ...................................................................... 153
  p95: ......................................................................... 162.4
  p99: ......................................................................... 169
http.response_time.2xx:
  min: ......................................................................... 153
  max: ......................................................................... 534
  mean: ........................................................................ 161.1
  median: ...................................................................... 159.2
  p95: ......................................................................... 165.7
  p99: ......................................................................... 172.5
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 17
  mean: ........................................................................ 0.7
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.responses: ................................................................ 744
vusers.completed: .............................................................. 366
vusers.created: ................................................................ 380
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  380
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1156.4
  max: ......................................................................... 1542.4
  mean: ........................................................................ 1166.6
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1176.4


--------------------------------------
Metrics for period to: 22:22:00(-0500) (width: 6.843s)
--------------------------------------

http.codes.201: ................................................................ 272
http.codes.400: ................................................................ 315
http.downloaded_bytes: ......................................................... 143372
http.request_rate: ............................................................. 87/sec
http.requests: ................................................................. 578
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 518
  mean: ........................................................................ 75.1
  median: ...................................................................... 2
  p95: ......................................................................... 162.4
  p99: ......................................................................... 186.8
http.response_time.2xx:
  min: ......................................................................... 152
  max: ......................................................................... 518
  mean: ........................................................................ 161
  median: ...................................................................... 156
  p95: ......................................................................... 165.7
  p99: ......................................................................... 190.6
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 6
  mean: ........................................................................ 0.8
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 4
http.responses: ................................................................ 587
vusers.completed: .............................................................. 315
vusers.created: ................................................................ 263
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  263
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.4
  max: ......................................................................... 1529.6
  mean: ........................................................................ 1165.8
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1200.1


All VUs finished. Total time: 52 seconds

--------------------------------
Summary report @ 22:21:58(-0500)
--------------------------------

http.codes.201: ................................................................ 1075
http.codes.400: ................................................................ 1075
http.downloaded_bytes: ......................................................... 522450
http.request_rate: ............................................................. 53/sec
http.requests: ................................................................. 2150
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 534
  mean: ........................................................................ 80.7
  median: ...................................................................... 16.9
  p95: ......................................................................... 162.4
  p99: ......................................................................... 169
http.response_time.2xx:
  min: ......................................................................... 152
  max: ......................................................................... 534
  mean: ........................................................................ 160.5
  median: ...................................................................... 159.2
  p95: ......................................................................... 165.7
  p99: ......................................................................... 183.1
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 17
  mean: ........................................................................ 0.8
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 4
http.responses: ................................................................ 2150
vusers.completed: .............................................................. 1075
vusers.created: ................................................................ 1075
vusers.created_by_name.Inundación transaccional perimetral (Payloads Mixtos ...  1075
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.4
  max: ......................................................................... 1542.4
  mean: ........................................................................ 1166.2
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1200.1
Log file: evidencias-pruebas/artillery-report-atlas-pool.json

Checks:
ok: maxErrorRate < 1
ok: http.response_time.p99 < 200